#include "common.h"

typedef struct UnkStruct_801561D8_s {
    /* 0x000 */ char pad0[0xE8];
    /* 0x0E8 */ f32 unkE8;        /* inferred */
    /* 0x0EC */ f32 unkEC;        /* inferred */
    /* 0x0F0 */ char padF0[0x48]; /* maybe part of unkEC[0x13]? */
} UnkStruct_801561D8;             /* size = 0x138 */

typedef struct DebugMenuInfo_s {
    /* 0x00 */ s32 unk0;                                   /* inferred */
    /* 0x04 */ char* optionName;                           /* inferred */
    /* 0x08 */ s32 unk8;                                   /* inferred */
    /* 0x0C */ s32 unkC;                                   /* inferred */
    /* 0x10 */ s32 unk10;                                  /* inferred */
    /* 0x14 */ s32 (*unk14)(struct DebugMenuInfo_s*, s32); /* inferred */
    /* 0x18 */ s32 (*unk18)(struct DebugMenuInfo_s*);      /* inferred */
    /* 0x1C */ char pad1C[0xC];                            /* maybe part of unk18[3]? */
} DebugMenuInfo;                                           /* size = 0x28 */

void func_800198F8(void*, s32);
void func_80019F4C(UnkStruct_8000DDE0*); /* extern */
void func_8008EC8C(f32, f32);            /* extern */
void func_8008ECAC(f32, f32);            /* extern */
void func_80090728(s32);                 /* extern */
void func_80090754(s32);                 /* extern */
void func_80090A38(s32, s32);            /* extern */
void func_80096374(void*);               /* extern */
void func_80096474(void);                /* extern */
void func_800967D8(void);                /* extern */
s16 func_800AD774(s32);                  /* extern */
void func_800962B0(void*);               /* extern */
void func_800029BC(void);                /* extern */
void func_80005124(s32, s32);            /* extern */
void func_80005460(void);                /* extern */
